{-# OPTIONS_GHC -fno-warn-missing-signatures #-}
{-# LANGUAGE QuasiQuotes #-}

module Grammar.Greek.Morph.Smyth.Verbs.Participles where

import Grammar.Greek.Morph.QuasiQuoters

-- Smyth 305 participles in -ων, -ουσα, -ον
participlesOne =
    -- masculine
    [ [nounParadigm|
        λύ̄ων
        λύ̄οντος
        λύ̄οντι
        λύ̄οντα
        λύ̄ων

        λύ̄οντε
        λῡόντοιν

        λύ̄οντες
        λῡόντων
        λύ̄ουσι(ν)
        λύ̄οντας
    |]
    -- feminine
    , [nounParadigm|
        λύ̄ουσα
        λῡούσης
        λῡούσῃ
        λύ̄ουσαν
        λύ̄ουσα

        λῡούσᾱ
        λῡούσαιν

        λύ̄ουσαι
        λῡουσῶν
        λῡούσαις
        λῡούσᾱς
    |]
    -- neuter
    , [nounParadigm|
        λύ̄ον
        λύ̄οντος
        λύ̄οντι
        λῦον
        λύ̄ον

        λύ̄οντε
        λῡόντοιν

        λύ̄οντα
        λῡόντων
        λύ̄ουσι(ν)
        λύ̄οντα
    |]
    -- masculine
    , [nounParadigm|
        *
        ὄντος
        ὄντι
        ὄντα
        *

        ὄντε
        ὄντοιν

        ὄντες
        ὄντων
        *
        ὄντας
    |]
--        ὤν : N V Sg
--        οὖσι(ν) : Pl D
    -- feminine
    , [nounParadigm|
        οὖσα
        οὔσης
        οὔσῃ
        οὖσαν
        οὖσα

        οὔσᾱ
        οὔσαιν

        οὖσαι
        οὐσῶν
        οὔσαις
        οὔσᾱς
    |]
    -- neuter
    , [nounParadigm|
        ὄν
        ὄντος
        ὄντι
        ὄν
        ὄν

        ὄντε
        ὄντοιν

        ὄντα
        ὄντων
        *
        ὄντα
    |]
--        οὖσι(ν) : Pl D
 ]

-- Smyth 306 participles in -ᾱς, -ᾱσα
participlesTwo =
    [ [nounParadigm|
        λῡ́σᾱς
        λῡ́σαντος
        λῡ́σαντι
        λῡ́σαντα
        λῡ́σᾱς

        λῡ́σαντε
        λῡσάντοιν

        λῡ́σαντες
        λῡσάντων
        λῡ́σᾱσι(ν)
        λῡ́σαντας
    |]
    , [nounParadigm|
        λῡ́σᾱσα
        λῡσᾱ́σης
        λῡσᾱ́σῃ
        λῡ́σᾱσαν
        λῡ́σᾱσα

        λῡσᾱ́σᾱ
        λῡσᾱ́σαιν

        λῡ́σᾱσαι
        λῡσᾱσῶν
        λῡσᾱ́σαις
        λῡσᾱ́σας
    |]
    , [nounParadigm|
        λῦσαν
        λῡ́σαντος
        λῡ́σαντ
        λῦσαν
        λῦσαν

        λῡ́σαντε
        λῡσάντοιν

        λῡ́σαντα
        λῡσάντων
        λῡ́σᾱσι(ν)
        λῡ́σαντ-α
    |]
    , [nounParadigm|
        ἱστᾱ́ς
        ἱστάντος
        ἱστάντι
        ἱστάντα
        ἱστᾱ́ς

        ἱστάντε
        ἱστάντοιν

        ἱστάντες
        ἱστάντων
        ἱστᾶσι(ν)
        ἱστάντας
    |]
    , [nounParadigm|
        ἱστᾶσα
        ἱστᾱ́σης
        ἱστᾱ́σῃ
        ἱστᾶσαν
        ἱστᾶσα

        ἱστᾱ́σᾱ
        ἱστᾱ́σαιν

        ἱστᾶσαι
        ἱστᾱσῶν
        ἱστᾱ́σαις
        ἱστᾱ́σᾱς
    |]
    , [nounParadigm|
        ἱστάν
        ἱστάντος
        ἱστάντι
        ἱστάν
        ἱστάν

        ἱστάντε
        ἱστάντοιν

        ἱστάντα
        ἱστάντων
        ἱστᾶσι(ν)
        ἱστάντα
    |]
  ]

 -- Smyth 307 participles in -εις, -εισα, -εν; -ους, -ουσα, -ον (μι-verbs)
participlesThree =
    [ [nounParadigm|
        τιθείς
        τιθέντος
        τιθέντι
        τιθέντα
        τιθείς

        τιθέντε
        τιθέντοιν

        τιθέντες
        τιθέντων
        τιθεῖσι(ν)
        τιθέντας
    |]
    , [nounParadigm|
        τιθεῖσα
        τιθείσης
        τιθείσῃ
        τιθεῖσαν
        τιθεῖσα

        τιθείσᾱ
        τιθείσαιν

        τιθεῖσαι
        τιθεισῶν
        τιθείσαις
        τιθείσᾱς
    |]
    , [nounParadigm|
        τιθέν
        τιθέντος
        τιθέντι
        τιθέν
        τιθέν

        τιθέντε
        τιθέντοιν

        τιθέντα
        τιθώντων
        τιθεῖσι(ν)
        τιθέντα
    |]
    , [nounParadigm|
        διδούς
        διδόντος
        διδόντι
        διδόντα
        διδούς

        διδόντε
        διδόντοιν

        διδόντες
        διδόντων
        διδοῦσι(ν)
        διδόντας
    |]
    , [nounParadigm|
        διδοῦσα
        διδούσης
        διδούσῃ
        διδοῦσαν
        διδοῦσα

        διδούσᾱ
        διδούσαιν

        διδοῦσαι
        διδουσῶν
        διδούσαις
        διδούσᾱς
    |]
    , [nounParadigm|
        διδόν
        διδόντος
        διδόντι
        διδόν
        διδόν

        διδόντε
        διδόντοιν

        διδόντα
        διδόντων
        διδοῦσι(ν)
        διδόντα
     |]
    ]

-- Smyth 308 participles in -εις, -εισα, -εν; -ους, -ουσα, -ον (μι-verbs)
participlesFour =
    [ [nounParadigm|
        δεικνῡ́ς
        δεικνύντος
        δεικνύντι
        δεικνύντα
        δεικνῡ́ς

        δεικνύντε
        δεικνύντοιν

        δεικνύντες
        δεικνύντων
        δεικνῦσι(ν)
        δεικνύντας
    |]
    , [nounParadigm|
        δεικνῦσα
        δεικνῡ́σης
        δεικνῡ́σῃ
        δεικνῦσαν
        δεικνῦσα

        δεικνῡ́σᾱ
        δεικνῡ́σαιν

        δεικνῦσαι
        δεικνῡσῶν
        δεικνῡ́σαις
        δεικνῡ́σᾱς
    |]
    , [nounParadigm|
        δεικνύν
        δεικνύντος
        δεικνύντι
        δεικνύν
        δεικνύν

        δεικνύντε
        δεικνύντοιν

        δεικνύντα
        δεικνύντων
        δεικνῦσι(ν)
        δεικνύντα
    |]
    , [nounParadigm|
        φῡ́ς
        φύντος
        φύντι
        φύντα
        φῡ́ς

        φύντε
        φύντοιν

        φύντες
        φύντων
        φῦσι(ν)
        φύντας
    |]
    , [nounParadigm|
        φῦσα
        φῡ́σης
        φῡ́σῃ
        φῦσαν
        φῦσα

        φῡ́σᾱ
        φῡ́σαιν

        φῦσαι
        φῡσῶν
        φῡ́σαις
        φῡ́σᾱς
    |]
    , [nounParadigm|
        φύν
        φύντος
        φύντι
        φύν
        φύν

        φύντε
        φύντοιν

        φύντα
        φύντων
        φῦσι(ν)
        φύντα
    |]
   ]

-- Smyth 309 Perfect active participles in -ως, -υια, -ος
participlesPerfectActive =
    [ [nounParadigm|
        λελυκώς
        λελυκότος
        λελυκότι
        λελυκότα
        λελυκώς

        λελυκότε
        λελυκότοιν

        λελυκότες
        λελυκότων
        λελυκόσι(ν)
        λελυκότας
    |]
    , [nounParadigm|
        λελυκυῖα
        λελυκυίᾱς
        λελυκυίᾳ
        λελυκῖᾱν
        λελυκυῖα

        λελυκυίᾱ
        λελυκυίαιν

        λελυκυῖαι
        λελυκυιῶν
        λελυκυίαις
        λελυκυίᾱς
    |]
    , [nounParadigm|
        λελυκός
        λελυκότος
        λελυκότι
        λελυκός
        λελυκός

        λελυκότε
        λελυκότοιν

        λελυκότα
        λελυκότων
        λελυκόσι(ν)
        λελυκότα
    |]
    , [nounParadigm|
        εἰδώς
        εἰδότος
        εἰδότι
        εἰδότα
        εἰδώς

        εἰδότε
        εἰδότοιν

        εἰδότες
        εἰδότων
        εἰδόσι(ν)
        εἰδότας
    |]
    , [nounParadigm|
        εἰδυῖα
        εἰδυίᾱς
        εἰδυίᾳ
        εἰδυῖαν
        εἰδυῖα

        εἰδυίᾱ
        εἰδυίαιν

        εἰδυῖαι
        εἰδυιῶν
        εἰδυίαις
        εἰδυίᾱς
    |]
    , [nounParadigm|
        εἰδός
        εἰδότος
        εἰδότι
        εἰδός
        εἰδός

        εἰδότε
        εἰδότοιν

        εἰδότα
        εἰδότων
        εἰδόσι(ν)
        εἰδότα
    |]
   ]

-- Smyth 310 Contract Particlples
participlesContract =
    [ [nounParadigm|
        τῑμῶν
        τῑμῶντος
        τῑμῶντι
        τῑμῶντα
        τῑμῶν

        τῑμῶντε
        τῑμώντοιν

        τῑμῶντες
        τῑμώντων
        τῑμῶσι(ν)
        τῑμῶντας
    |]
    , [nounParadigm|
        τῑμῶσα
        τῑμώσης
        τῑμώσῃ
        τῑμῶσαν
        τῑμῶσα

        τῑμώσᾱ
        τῑμώσαιν

        τῑμῶσαι
        τῑμωσῶν
        τῑμώσαις
        τῑμώσᾱς
    |]
    , [nounParadigm|
        τῑμῶν
        τῑμῶντος
        τῑμῶντι
        τῑμῶν
        τῑμῶν

        τῑμῶντε
        τῑμώντοιν

        τῑμῶντα
        τῑμώντων
        τῑμῶσι(ν)
        τιμῶντα
    |]
    , [nounParadigm|
        ποιῷν
        ποιοῦντος
        ποιοῦντι
        ποιοῦντα
        ποιῷν

        ποιοῦντε
        ποιούντοιν

        ποιοῦντες
        ποιούντων
        ποιοῦσι(ν)
        ποιοῦντας
    |]
    , [nounParadigm|
        ποιοῦσα
        ποιούσης
        ποιούσῃ
        ποιοῦσαν
        ποιοῦσα

        ποιούσᾱ
        ποιούσαιν

        ποιοῦσαι
        ποιουσῶν
        ποιούσαις
        ποιούσᾱς
    |]
    , [nounParadigm|
        ποιοῦν
        ποιοῦντος
        ποιοῦντι
        ποιοῦν
        ποιοῦν

        ποιοῦντε
        ποιούντοιν

        ποιοῦντα
        ποιούντων
        ποιοῦσι(ν)
        ποιοῦντα
    |]
  ]



-- Ἀτρείδης
-- Ἀτρείδου
-- Ἀτρείδῃ
-- Ἀτρείδη-ν
-- Ἀτρείδη

-- Ἀτρείδᾱ
-- Ἀτρείδαιν

-- Ἀτρεῖδαι
-- Ἀτρειδῶν
-- Ἀτρείδαις
-- Ἀτρείδᾱς
--     |]
--   ]
