{-# OPTIONS_GHC -fno-warn-missing-signatures #-}
{-# LANGUAGE QuasiQuotes #-}

module Grammar.Greek.Morph.Smyth.Adjectives where

import Grammar.Greek.Morph.QuasiQuoters

-- Smyth 287 ADJECTIVES WITH THREE ENDINGS
adjectivesThreeEndings =
   [ [nounParadigm|
        ἀγαθός
        ἀγαθοῦ
        ἀγαθῷ
        ἀγαθόν
        ἀγαθέ

        ἀγαθώ
        ἀγαθοῖν

        ἀγαθοί
        ἀγαθῶν
        ἀγαθοῖς
        ἀγαθούς
    |]
    , [nounParadigm|
        ἀγαθή
        ἀγαθῆς
        ἀγαθῇ
        ἀγαθήν
        ἀγαθή

        ἀγαθά̄
        ἀγαθαῖν

        ἀγαθαί
        ἀγαθῶν
        ἀγαθαῖς
        ἀγαθά̄ς
    |]
    , [nounParadigm|
        ἀγαθόν
        ἀγαθοῦ
        ἀγαθῷ
        ἀγαθόν
        ἀγαθόν

        ἀγαθώ
        ἀγαθοῖν

        ἀγαθά
        ἀγαθῶν
        ἀγαθοῖς
        ἀγαθά
    |]
    , [nounParadigm|
        ἄξιος
        ἀξίου
        ἀξίῳ
        ἄξιον
        ἄξιε

        ἀξίω
        ἀξίοιν

        ἄξιοι
        ἀξίων
        ἀξίοις
        ἀξίους
    |]
    , [nounParadigm|
        ἀξίᾱ
        ἀξίᾱς
        ἀξίᾳ
        ἀξίᾱν
        ἀξίᾱ

        ἀξίᾱ
        ἀξίαιν

        ἄξιαι
        ἀξίων
        ἀξίαις
        ἀξίᾱς
    |]
    , [nounParadigm|
        ἄξιον
        ἀξίου
        ἀξίῳ
        ἄξιον
        ἄξιον

        ἀξίω
        ἀξίοιν

        ἄξια
        ἀξίων
        ἀξίοις
        ἄξια
    |]
    , [nounParadigm|
        μακρός
        μακροῦ
        μακρῷ
        μακρόν
        μακρέ

        μακρώ
        μακροῖν

        μακροί
        μακρῶν
        μακροῖς
        μακρούς
    |]
    , [nounParadigm|
        μακρά
        μακρᾶς
        μακρᾷ
        μακράν
        μακρά

        μακρά
        μακραῖν

        μακραί
        μακρῶν
        μακραῖς
        μακράς
    |]
    , [nounParadigm|
        μακρόν
        μακροῦ
        μακρῷ
        μακρόν
        μακρόν

        μακρώ
        μακροῖν

        μακρά
        μακρῶν
        μακροῖς
        μακρά
    |]
   ]
-- Smyth 289 ADJECTIVES WITH TWO ENDINGS
adjectivesTwoEndings =
   [ [nounParadigm|
        ἄδικος
        ἀδίκου
        ἀδίκῳ
        ἄδικον
        ἄδικε

        ἀδίκω
        ἀδίκοιν

        ἄδικοι
        ἀδίκων
        ἀδίκοις
        ἀδίκους
    |]
    , [nounParadigm|
        ἄδικον
        ἀδίκου
        ἀδίκῳ
        ἄδικον
        ἄδικον

        ἀδίκω
        ἀδίκοιν

        ἄδικα
        ἀδίκων
        ἀδίκοις
        ἄδικα
    |]
    , [nounParadigm|
        φρόνιμος
        φρονίμου
        φρυνίμῳ
        φρόνιμον
        φρόνιμε

        φρονίμω
        φρονίμοιν

        φρόνιμοι
        φρονίμων
        φρονίμοις
        φρονίμους
    |]
    , [nounParadigm|
        φρόνιμον
        φρονίμου
        φρονίμῳ
        φρόνιμον
        φρόνιμον

        φρονίμω
        φρονίμοιν

        φρόνιμα
        φρονίμων
        φρονίμοις
        φρόνιμα
    |]
    , [nounParadigm|
        ἵλεως
        ἵλεω
        ἵλεῳ
        ἵλεων
        ἵλεως

        ἵλεω
        ἵλεῳ

        ἵλεῳ
        ἵλεων
        ἵλεῳς
        ἵλεως
    |]
    , [nounParadigm|
        ἵλεων
        ἵλεω
        ἵλεῳ
        ἵλεων
        ἵλεων

        ἵλεω
        ἵλεῳν

        ἵλεα
        ἵλεων
        ἵλεῳς
        ἵλεα
    |]
   ]

-- Smyth 290 Contract Adjectives
adjectivesContract =
   [ [nounParadigm|
        ἀργυροῦς
        ἀργυροῦ
        ἀργυρῷ
        ἀργυροῦν
        ἀργυροῦς

        ἀργυρώ
        ἀργυροῖν

        ἀργυροῖ
        ἀργυρῶν
        ἀργυροῖς
        ἀργυροῦς
    |]
    , [nounParadigm|
        ἀργυρᾶ
        ἀργυρᾶς
        ἀργυρᾷ
        ἀργυρᾶν
        ἀργυρᾶ

        ἀργυρᾶ
        ἀργυραῖν

        ἀργυραῖ
        ἀργυρῶν
        ἀργυραῖς
        ἀργυρᾶς
    |]
    , [nounParadigm|
        ἀργυροῦν
        ἀργυροῦ
        ἀργυρῷ
        ἀργυροῦν
        ἀργυροῦν

        ἀργυρώ
        ἀργυροῖν

        ἀργυρᾶ
        ἀργυρῶν
        ἀργυροῖς
        ἀργυρᾶ
    |]
    , [nounParadigm|
        ἁπλοῦς
        ἁπλοῦ
        ἁπλῷ
        ἁπλοῦν
        ἁπλοῦς

        ἁπλώ
        ἁπλοῖν

        ἁπλοῖ
        ἁπλῶν
        ἁπλοῖς
        ἁπλοῦς
    |]
    , [nounParadigm|
        ἁπλῆ
        ἁπλῆς
        ἁπλῇ
        ἁπλῆν
        ἁπλῆ

        ἁπλᾶ
        ἁπλαῖν

        ἁπλαῖ
        ἁπλῶν
        ἁπλαῖς
        ἁπλᾶς
    |]
    , [nounParadigm|
        ἁπλοῦν
        ἁπλοῦ
        ἁπλῷ
        ἁπλοῦν
        ἁπλοῦν

        ἁπλώ
        ἁπλοῖν

        ἁπλᾶ
        ἁπλῶν
        ἁπλοῖς
        ἁπλᾶ
    |]
   ]
